# Current Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregateIterator..::..Current Property
IFCAggregateIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IFCData Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As IFCData
	Get
```

Visual C++
---
```text
public:
virtual property IFCData^ Current {
	IFCData^ get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace